Pinned objects were not deleted. To delete them, unpin them before using delete.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PinnedObjectNotDeleted { get; }
  Visual Basic
Public Shared ReadOnly Property PinnedObjectNotDeleted As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PinnedObjectNotDeleted {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace